Revit 2027 API
OrdinateDimensionSetting.OriginTickMarkId Property
 Specifies the id of the tick mark element to use for the dimension origin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OriginTickMarkId { get; set; }
Public Property OriginTickMarkId As ElementId
	Get
	Set
public:
property ElementId^ OriginTickMarkId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member OriginTickMarkId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace